app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("site_id", "updated_at", "down", "author", "up", "login", "password", "created_at") VALUES(1, '2009-06-04 08:14:10', NULL, 'mav', NULL, 'foo', 'bar', '2009-06-04 08:14:10')
SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def create
    Account.create do |account|
      account.site = Site.find(params["site"]["id"])