app/controllers/sites_controller.rb

SELECT * FROM "sites" WHERE ("sites"."url" = 'http://localhost:3000') LIMIT 1
---
  def search
    address = params[:url]
    match = Site.parse(address)
    render :text => '' and return unless match
    site = Site.find_by_url(match[:full_url])