app/controllers/sites_controller.rb

SELECT * FROM "sites" WHERE ("sites"."domain" = 'nytimes.com') LIMIT 1
SELECT * FROM "accounts" WHERE ("accounts".site_id = 1)
---
  def search
    domain = params["url"].domain if params["url"]
    render :text => '' and return unless domain
    site = Site.find_by_domain(domain)
    render :text => '' and return unless site
    data = []
    site.accounts.each do |account|

INSERT INTO "sites" ("regex", "updated_at", "domain", "created_at") VALUES(NULL, '2009-06-12 22:50:03', 'nytimes.com', '2009-06-12 22:50:03')
---
  def create
    domain = params["site"]["domain"].domain if params["site"]["domain"]
    Site.create do |site|