app/controllers/welcome_controller.rb

  def index
    @sites = Site.all
---
SELECT * FROM "sites"